topic/gradle/gradle.org
#+TITLE: Gradle Help
#+EXPORT_FILE_NAME: ./gradle.html
#+SETUPFILE: https://devlibx.github.io/emacs/org/theams/theme-readtheorg/theme-readtheorg.setup
#+OPTIONS: num:nil

* Setup common dependency using Gradle
** buildSrc
This is to create common conventions
*** build.gradle
#+begin_src 
plugins {
    id 'groovy-gradle-plugin'
}

repositories {
    gradlePluginPortal()
}
#+end_src

*** devlibx.common.gradle
Create a file src/main/groovy/devlibx.common.gradle
#+begin_src
plugins {
    id 'java-library'
}

dependencies {
    implementation platform('io.github.devlibx.easy:easy:0.0.138')
    api platform('io.github.devlibx.easy:easy:0.0.138')
    implementation 'org.projectlombok:lombok'
    implementation 'com.fasterxml.jackson.core:jackson-databind'
    implementation 'com.fasterxml.jackson.core:jackson-core'
    implementation 'com.fasterxml.jackson.core:jackson-annotations'

    annotationProcessor 'org.projectlombok:lombok:1.18.30'
}
#+end_src

* Use in in your sub-rpojects
Once your have common script, you can use it in your build.gradle files
#+begin_src
  plugins {
    id 'devlibx.common'
    ...
    ...
}
#+end_src  

Not all the settings in buildSrc will be avaliable here
