topic/gradle/gradle.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-12-31 Sun 13:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Gradle Help</title>
<meta name="author" content="Harish Bohara" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://devlibx.github.io/emacs/org/theams/theme-readtheorg/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://devlibx.github.io/emacs/org/theams/theme-readtheorg/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Gradle Help</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org50b64dd">Setup common dependency using Gradle</a>
<ul>
<li><a href="#org1797817">buildSrc</a>
<ul>
<li><a href="#orge9ee391">build.gradle</a></li>
<li><a href="#orgd39d036">devlibx.common.gradle</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org664b640">Use in in your sub-rpojects</a></li>
</ul>
</div>
</div>

<div id="outline-container-org50b64dd" class="outline-2">
<h2 id="org50b64dd">Setup common dependency using Gradle</h2>
<div class="outline-text-2" id="text-org50b64dd">
</div>
<div id="outline-container-org1797817" class="outline-3">
<h3 id="org1797817">buildSrc</h3>
<div class="outline-text-3" id="text-org1797817">
<p>
This is to create common conventions
</p>
</div>
<div id="outline-container-orge9ee391" class="outline-4">
<h4 id="orge9ee391">build.gradle</h4>
<div class="outline-text-4" id="text-orge9ee391">
<pre class="example">
plugins {
    id 'groovy-gradle-plugin'
}

repositories {
    gradlePluginPortal()
}
</pre>
</div>
</div>

<div id="outline-container-orgd39d036" class="outline-4">
<h4 id="orgd39d036">devlibx.common.gradle</h4>
<div class="outline-text-4" id="text-orgd39d036">
<p>
Create a file src/main/groovy/devlibx.common.gradle
</p>
<pre class="example">
plugins {
    id 'java-library'
}

dependencies {
    implementation platform('io.github.devlibx.easy:easy:0.0.138')
    api platform('io.github.devlibx.easy:easy:0.0.138')
    implementation 'org.projectlombok:lombok'
    implementation 'com.fasterxml.jackson.core:jackson-databind'
    implementation 'com.fasterxml.jackson.core:jackson-core'
    implementation 'com.fasterxml.jackson.core:jackson-annotations'

    annotationProcessor 'org.projectlombok:lombok:1.18.30'
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org664b640" class="outline-2">
<h2 id="org664b640">Use in in your sub-rpojects</h2>
<div class="outline-text-2" id="text-org664b640">
<p>
Once your have common script, you can use it in your build.gradle files
</p>
<pre class="example">
  plugins {
    id 'devlibx.common'
    ...
    ...
}
</pre>

<p>
Not all the settings in buildSrc will be avaliable here
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Harish Bohara</p>
<p class="date">Created: 2023-12-31 Sun 13:57</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>